app/Controllers/ManajementArtikel.php

SELECT *
FROM `artikel`
ORDER BY `id_artikel` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
---
    public function MajanementArtikel()
    {
        $alamat = $this->DataAlamat->findAll();
        $artikel = $this->DataArtikel->orderBy('id_artikel', 'DESC')->paginate(10, 'artikel');