app/Controllers/ProgramController.php

    public function program()
    {
        $hakAkses = session()->get('level');
        $alamat = $this->DataAlamat->findAll();
        $program = $this->DataProgram->findAll();
---
SELECT *
FROM `program`