app/Models/ArtikelModel.php

SELECT *
FROM `artikel`
WHERE `id_artikel` = '1'
 LIMIT 1
---
    public function getArtikel($id = false)
    {

        if ($id === false) {
            return $this->findAll();
        }

        return $this->where(['id_artikel' => $id,])->first();

SELECT *
FROM `artikel`
ORDER BY RAND()
 LIMIT 1
---
    public function getRandomArtikel()
    {
        $query =  $this->db->table('artikel')
            ->orderBy('RAND()')
            ->limit(1)
            ->get();